#language: ru

@tree

Функционал: Добро пожаловать!

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект> 
Контекст:
	//Дано я запускаю SikuliX сервер
	Дано Я подключаю клиент тестирования по имени "Веб"

Сценарий: Добро пожаловать
	*Добро пожаловать!
		И Пауза 1
	*Это пособие предназначено для тех, кто только начинает знакомиться с адин эс бугалтерией восемь для Мол  довы
		И Пауза 1
	*С его помощью Вы сможете быстро освоить основные приемы работы с адин эс бугалтерией восемь для Мол  довы и сразу приступить к делу.
		И Пауза 1
	*Пособие построено в виде сквозного примера хозяйственной деятельности организации. 
		И Пауза 1
	*В видео содержатся подробные инструкции, последовательно выполняя которые, Вы сможете:
		И Пауза 1
	*заполнить сведения об организации, ввести сведения о контрагентах,
		И Пауза 1
	*заполнить номенклатуру продаваемых и приобретаемых товаров, отразить в программе ряд основных хозяйственных операций (покупка и продажа товаров, операции по расчетному счету и др.);
		И Пауза 1
	
		И Пауза 1
	*сформировать отчет для анализа введенных проводок;
		И Пауза 1
	*построить бухгалтерский баланс.
		И Пауза 1