
#language: ru

@tree

Функциональность: Дымовые тесты

Контекст:
	Попытка
		Дано Я подключаю клиент тестирования по имени "Веб"
	Исключение
		Дано Я подключаю клиент тестирования по имени "Веб"	
	//Дано Я подключаю клиент тестирования по имени "Этот клиент"
	
	Дано я активизирую окно текущего клиента тестирования
	И я закрываю все окна клиентского приложения

	
Сценарий: Открытие формы списка "АвансовыйОтчет" 

	Дано Я открываю основную форму списка документа "АвансовыйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйОтчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыйОтчет"

	Дано Я открываю основную форму документа "АвансовыйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйОтчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Авто_АвансовыйОтчетВВалюте" 

	Дано Я открываю основную форму списка документа "Авто_АвансовыйОтчетВВалюте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_АвансовыйОтчетВВалюте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Авто_АвансовыйОтчетВВалюте"

	Дано Я открываю основную форму документа "Авто_АвансовыйОтчетВВалюте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_АвансовыйОтчетВВалюте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Авто_АктПриемкиПередачи" 

	Дано Я открываю основную форму списка документа "Авто_АктПриемкиПередачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_АктПриемкиПередачи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Авто_АктПриемкиПередачи"

	Дано Я открываю основную форму документа "Авто_АктПриемкиПередачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_АктПриемкиПередачи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Авто_Зарплата" 

	Дано Я открываю основную форму списка документа "Авто_Зарплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_Зарплата"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Авто_Зарплата"

	Дано Я открываю основную форму документа "Авто_Зарплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_Зарплата"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Авто_Заявка" 

	Дано Я открываю основную форму списка документа "Авто_Заявка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_Заявка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Авто_Заявка"

	Дано Я открываю основную форму документа "Авто_Заявка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_Заявка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Авто_ИзменениеСостоянияАвто" 

	Дано Я открываю основную форму списка документа "Авто_ИзменениеСостоянияАвто"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_ИзменениеСостоянияАвто"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Авто_ИзменениеСостоянияАвто"

	Дано Я открываю основную форму документа "Авто_ИзменениеСостоянияАвто"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_ИзменениеСостоянияАвто"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Авто_КалькуляцияПоКосвеннымЗатратам" 

	Дано Я открываю основную форму списка документа "Авто_КалькуляцияПоКосвеннымЗатратам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_КалькуляцияПоКосвеннымЗатратам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Авто_КалькуляцияПоКосвеннымЗатратам"

	Дано Я открываю основную форму документа "Авто_КалькуляцияПоКосвеннымЗатратам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_КалькуляцияПоКосвеннымЗатратам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Авто_КалькуляцияПоПрямымЗатратам" 

	Дано Я открываю основную форму списка документа "Авто_КалькуляцияПоПрямымЗатратам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_КалькуляцияПоПрямымЗатратам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Авто_КалькуляцияПоПрямымЗатратам"

	Дано Я открываю основную форму документа "Авто_КалькуляцияПоПрямымЗатратам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_КалькуляцияПоПрямымЗатратам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Авто_КалькуляцияУслуг" 

	Дано Я открываю основную форму списка документа "Авто_КалькуляцияУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_КалькуляцияУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Авто_КалькуляцияУслуг"

	Дано Я открываю основную форму документа "Авто_КалькуляцияУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_КалькуляцияУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Авто_ПеремещениеПоДатам" 

	Дано Я открываю основную форму списка документа "Авто_ПеремещениеПоДатам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_ПеремещениеПоДатам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Авто_ПеремещениеПоДатам"

	Дано Я открываю основную форму документа "Авто_ПеремещениеПоДатам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_ПеремещениеПоДатам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Авто_ПоказанияСпидометраНаКонецМесяца" 

	Дано Я открываю основную форму списка документа "Авто_ПоказанияСпидометраНаКонецМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_ПоказанияСпидометраНаКонецМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Авто_ПоказанияСпидометраНаКонецМесяца"

	Дано Я открываю основную форму документа "Авто_ПоказанияСпидометраНаКонецМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_ПоказанияСпидометраНаКонецМесяца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Авто_РасхНалоговаяНакладная" 

	Дано Я открываю основную форму списка документа "Авто_РасхНалоговаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_РасхНалоговаяНакладная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Авто_РасхНалоговаяНакладная"

	Дано Я открываю основную форму документа "Авто_РасхНалоговаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_РасхНалоговаяНакладная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Авто_РасходТопливаПоНормам" 

	Дано Я открываю основную форму списка документа "Авто_РасходТопливаПоНормам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_РасходТопливаПоНормам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Авто_РасходТопливаПоНормам"

	Дано Я открываю основную форму документа "Авто_РасходТопливаПоНормам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Авто_РасходТопливаПоНормам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвтоПас_АктПриемкиПередачи" 

	Дано Я открываю основную форму списка документа "АвтоПас_АктПриемкиПередачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_АктПриемкиПередачи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвтоПас_АктПриемкиПередачи"

	Дано Я открываю основную форму документа "АвтоПас_АктПриемкиПередачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_АктПриемкиПередачи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвтоПас_ЗакрытиеАвансов" 

	Дано Я открываю основную форму списка документа "АвтоПас_ЗакрытиеАвансов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_ЗакрытиеАвансов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвтоПас_ЗакрытиеАвансов"

	Дано Я открываю основную форму документа "АвтоПас_ЗакрытиеАвансов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_ЗакрытиеАвансов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвтоПас_Заявка" 

	Дано Я открываю основную форму списка документа "АвтоПас_Заявка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_Заявка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвтоПас_Заявка"

	Дано Я открываю основную форму документа "АвтоПас_Заявка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_Заявка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвтоПас_КалькуляцияПоКосвеннымЗатратам" 

	Дано Я открываю основную форму списка документа "АвтоПас_КалькуляцияПоКосвеннымЗатратам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_КалькуляцияПоКосвеннымЗатратам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвтоПас_КалькуляцияПоКосвеннымЗатратам"

	Дано Я открываю основную форму документа "АвтоПас_КалькуляцияПоКосвеннымЗатратам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_КалькуляцияПоКосвеннымЗатратам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвтоПас_КалькуляцияПоПрямымЗатратам" 

	Дано Я открываю основную форму списка документа "АвтоПас_КалькуляцияПоПрямымЗатратам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_КалькуляцияПоПрямымЗатратам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвтоПас_КалькуляцияПоПрямымЗатратам"

	Дано Я открываю основную форму документа "АвтоПас_КалькуляцияПоПрямымЗатратам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_КалькуляцияПоПрямымЗатратам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвтоПас_ПеремещениеПоДатам" 

	Дано Я открываю основную форму списка документа "АвтоПас_ПеремещениеПоДатам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_ПеремещениеПоДатам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвтоПас_ПеремещениеПоДатам"

	Дано Я открываю основную форму документа "АвтоПас_ПеремещениеПоДатам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_ПеремещениеПоДатам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвтоПас_ПоказанияСпидометраНаКонецМесяца" 

	Дано Я открываю основную форму списка документа "АвтоПас_ПоказанияСпидометраНаКонецМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_ПоказанияСпидометраНаКонецМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвтоПас_ПоказанияСпидометраНаКонецМесяца"

	Дано Я открываю основную форму документа "АвтоПас_ПоказанияСпидометраНаКонецМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_ПоказанияСпидометраНаКонецМесяца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвтоПас_ПосадочныйЛист" 

	Дано Я открываю основную форму списка документа "АвтоПас_ПосадочныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_ПосадочныйЛист"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвтоПас_ПосадочныйЛист"

	Дано Я открываю основную форму документа "АвтоПас_ПосадочныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_ПосадочныйЛист"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АвтоПас_РасходТопливаПоНормам" 

	Дано Я открываю основную форму списка документа "АвтоПас_РасходТопливаПоНормам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_РасходТопливаПоНормам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвтоПас_РасходТопливаПоНормам"

	Дано Я открываю основную форму документа "АвтоПас_РасходТопливаПоНормам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвтоПас_РасходТопливаПоНормам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктНаСписание" 

	Дано Я открываю основную форму списка документа "АктНаСписание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктНаСписание"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктНаСписание"

	Дано Я открываю основную форму документа "АктНаСписание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктНаСписание"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктСверкиВзаиморасчетов" 

	Дано Я открываю основную форму списка документа "АктСверкиВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктСверкиВзаиморасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктСверкиВзаиморасчетов"

	Дано Я открываю основную форму документа "АктСверкиВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктСверкиВзаиморасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктСнятияШин" 

	Дано Я открываю основную форму списка документа "АктСнятияШин"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктСнятияШин"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктСнятияШин"

	Дано Я открываю основную форму документа "АктСнятияШин"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктСнятияШин"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктУстановкиШинИАккумуляторов" 

	Дано Я открываю основную форму списка документа "АктУстановкиШинИАккумуляторов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктУстановкиШинИАккумуляторов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктУстановкиШинИАккумуляторов"

	Дано Я открываю основную форму документа "АктУстановкиШинИАккумуляторов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктУстановкиШинИАккумуляторов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АнкетаЗастрахованногоЛица" 

	Дано Я открываю основную форму списка документа "АнкетаЗастрахованногоЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АнкетаЗастрахованногоЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АнкетаЗастрахованногоЛица"

	Дано Я открываю основную форму документа "АнкетаЗастрахованногоЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АнкетаЗастрахованногоЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АнулБлнкСтрогОтч" 

	Дано Я открываю основную форму списка документа "АнулБлнкСтрогОтч"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АнулБлнкСтрогОтч"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АнулБлнкСтрогОтч"

	Дано Я открываю основную форму документа "АнулБлнкСтрогОтч"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АнулБлнкСтрогОтч"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводВЭксплуатацию" 

	Дано Я открываю основную форму списка документа "ВводВЭксплуатацию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводВЭксплуатацию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводВЭксплуатацию"

	Дано Я открываю основную форму документа "ВводВЭксплуатацию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводВЭксплуатацию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводВЭксплуатациюНМА" 

	Дано Я открываю основную форму списка документа "ВводВЭксплуатациюНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводВЭксплуатациюНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводВЭксплуатациюНМА"

	Дано Я открываю основную форму документа "ВводВЭксплуатациюНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводВЭксплуатациюНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатков" 

	Дано Я открываю основную форму списка документа "ВводОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатков"

	Дано Я открываю основную форму документа "ВводОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратИзРозницы" 

	Дано Я открываю основную форму списка документа "ВозвратИзРозницы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзРозницы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратИзРозницы"

	Дано Я открываю основную форму документа "ВозвратИзРозницы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзРозницы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратИзРозницыСум" 

	Дано Я открываю основную форму списка документа "ВозвратИзРозницыСум"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзРозницыСум"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратИзРозницыСум"

	Дано Я открываю основную форму документа "ВозвратИзРозницыСум"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзРозницыСум"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыбытиеОС" 

	Дано Я открываю основную форму списка документа "ВыбытиеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыбытиеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыбытиеОС"

	Дано Я открываю основную форму документа "ВыбытиеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыбытиеОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Выдача" 

	Дано Я открываю основную форму списка документа "Выдача"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Выдача"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Выдача"

	Дано Я открываю основную форму документа "Выдача"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Выдача"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыдачаЗаработнойПлаты" 

	Дано Я открываю основную форму списка документа "ВыдачаЗаработнойПлаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыдачаЗаработнойПлаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыдачаЗаработнойПлаты"

	Дано Я открываю основную форму документа "ВыдачаЗаработнойПлаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыдачаЗаработнойПлаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыпискиБанка" 

	Дано Я открываю основную форму списка документа "ВыпискиБанка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыпискиБанка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыпискиБанка"

	Дано Я открываю основную форму документа "ВыпискиБанка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыпискиБанка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДляСоцФонда2013" 

	Дано Я открываю основную форму списка документа "ДляСоцФонда2013"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДляСоцФонда2013"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДляСоцФонда2013"

	Дано Я открываю основную форму документа "ДляСоцФонда2013"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДляСоцФонда2013"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДляСоцФонда2015" 

	Дано Я открываю основную форму списка документа "ДляСоцФонда2015"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДляСоцФонда2015"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДляСоцФонда2015"

	Дано Я открываю основную форму документа "ДляСоцФонда2015"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДляСоцФонда2015"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Доведение216" 

	Дано Я открываю основную форму списка документа "Доведение216"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Доведение216"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Доведение216"

	Дано Я открываю основную форму документа "Доведение216"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Доведение216"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорНаОказаниеУслуг" 

	Дано Я открываю основную форму списка документа "ДоговорНаОказаниеУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорНаОказаниеУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорНаОказаниеУслуг"

	Дано Я открываю основную форму документа "ДоговорНаОказаниеУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорНаОказаниеУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоначислениеНДС" 

	Дано Я открываю основную форму списка документа "ДоначислениеНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоначислениеНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоначислениеНДС"

	Дано Я открываю основную форму документа "ДоначислениеНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоначислениеНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_ВводНачОстатковБиологическиеАктивы" 

	Дано Я открываю основную форму списка документа "ЖВ_ВводНачОстатковБиологическиеАктивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ВводНачОстатковБиологическиеАктивы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_ВводНачОстатковБиологическиеАктивы"

	Дано Я открываю основную форму документа "ЖВ_ВводНачОстатковБиологическиеАктивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ВводНачОстатковБиологическиеАктивы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_ВыпускГотовойПродукции" 

	Дано Я открываю основную форму списка документа "ЖВ_ВыпускГотовойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ВыпускГотовойПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_ВыпускГотовойПродукции"

	Дано Я открываю основную форму документа "ЖВ_ВыпускГотовойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ВыпускГотовойПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_ВыходИнкубатория" 

	Дано Я открываю основную форму списка документа "ЖВ_ВыходИнкубатория"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ВыходИнкубатория"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_ВыходИнкубатория"

	Дано Я открываю основную форму документа "ЖВ_ВыходИнкубатория"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ВыходИнкубатория"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_ЗабойПадежЖивотных" 

	Дано Я открываю основную форму списка документа "ЖВ_ЗабойПадежЖивотных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ЗабойПадежЖивотных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_ЗабойПадежЖивотных"

	Дано Я открываю основную форму документа "ЖВ_ЗабойПадежЖивотных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ЗабойПадежЖивотных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_ЗакладкаВИнкубаторий" 

	Дано Я открываю основную форму списка документа "ЖВ_ЗакладкаВИнкубаторий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ЗакладкаВИнкубаторий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_ЗакладкаВИнкубаторий"

	Дано Я открываю основную форму документа "ЖВ_ЗакладкаВИнкубаторий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ЗакладкаВИнкубаторий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_Закрытие852" 

	Дано Я открываю основную форму списка документа "ЖВ_Закрытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_Закрытие852"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_Закрытие852"

	Дано Я открываю основную форму документа "ЖВ_Закрытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_Закрытие852"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_Калькуляция" 

	Дано Я открываю основную форму списка документа "ЖВ_Калькуляция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_Калькуляция"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_Калькуляция"

	Дано Я открываю основную форму документа "ЖВ_Калькуляция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_Калькуляция"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_ЛимитноЗаборнаяКарта" 

	Дано Я открываю основную форму списка документа "ЖВ_ЛимитноЗаборнаяКарта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ЛимитноЗаборнаяКарта"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_ЛимитноЗаборнаяКарта"

	Дано Я открываю основную форму документа "ЖВ_ЛимитноЗаборнаяКарта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ЛимитноЗаборнаяКарта"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_Открытие852" 

	Дано Я открываю основную форму списка документа "ЖВ_Открытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_Открытие852"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_Открытие852"

	Дано Я открываю основную форму документа "ЖВ_Открытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_Открытие852"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_ПередачаГотовойПродукцииНаСклад" 

	Дано Я открываю основную форму списка документа "ЖВ_ПередачаГотовойПродукцииНаСклад"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ПередачаГотовойПродукцииНаСклад"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_ПередачаГотовойПродукцииНаСклад"

	Дано Я открываю основную форму документа "ЖВ_ПередачаГотовойПродукцииНаСклад"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ПередачаГотовойПродукцииНаСклад"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_ПеремещениеБиологическихАктивов" 

	Дано Я открываю основную форму списка документа "ЖВ_ПеремещениеБиологическихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ПеремещениеБиологическихАктивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_ПеремещениеБиологическихАктивов"

	Дано Я открываю основную форму документа "ЖВ_ПеремещениеБиологическихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ПеремещениеБиологическихАктивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_ПриобретениеБиологическихАктивов" 

	Дано Я открываю основную форму списка документа "ЖВ_ПриобретениеБиологическихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ПриобретениеБиологическихАктивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_ПриобретениеБиологическихАктивов"

	Дано Я открываю основную форму документа "ЖВ_ПриобретениеБиологическихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ПриобретениеБиологическихАктивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_ПриплодИПривес" 

	Дано Я открываю основную форму списка документа "ЖВ_ПриплодИПривес"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ПриплодИПривес"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_ПриплодИПривес"

	Дано Я открываю основную форму документа "ЖВ_ПриплодИПривес"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_ПриплодИПривес"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЖВ_РеализацияБиологическихАктивов" 

	Дано Я открываю основную форму списка документа "ЖВ_РеализацияБиологическихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_РеализацияБиологическихАктивов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЖВ_РеализацияБиологическихАктивов"

	Дано Я открываю основную форму документа "ЖВ_РеализацияБиологическихАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЖВ_РеализацияБиологическихАктивов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗагрузкаНачислений" 

	Дано Я открываю основную форму списка документа "ЗагрузкаНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗагрузкаНачислений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗагрузкаНачислений"

	Дано Я открываю основную форму документа "ЗагрузкаНачислений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗагрузкаНачислений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗагрузкаРасчитанныхНалогов" 

	Дано Я открываю основную форму списка документа "ЗагрузкаРасчитанныхНалогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗагрузкаРасчитанныхНалогов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗагрузкаРасчитанныхНалогов"

	Дано Я открываю основную форму документа "ЗагрузкаРасчитанныхНалогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗагрузкаРасчитанныхНалогов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Закрытие7и6" 

	Дано Я открываю основную форму списка документа "Закрытие7и6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Закрытие7и6"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Закрытие7и6"

	Дано Я открываю основную форму документа "Закрытие7и6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Закрытие7и6"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Закрытие821" 

	Дано Я открываю основную форму списка документа "Закрытие821"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Закрытие821"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Закрытие821"

	Дано Я открываю основную форму документа "Закрытие821"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Закрытие821"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Закрытие821сум" 

	Дано Я открываю основную форму списка документа "Закрытие821сум"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Закрытие821сум"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Закрытие821сум"

	Дано Я открываю основную форму документа "Закрытие821сум"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Закрытие821сум"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Закрытие852" 

	Дано Я открываю основную форму списка документа "Закрытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Закрытие852"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Закрытие852"

	Дано Я открываю основную форму документа "Закрытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Закрытие852"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗакрытиеАвансов" 

	Дано Я открываю основную форму списка документа "ЗакрытиеАвансов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗакрытиеАвансов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗакрытиеАвансов"

	Дано Я открываю основную форму документа "ЗакрытиеАвансов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗакрытиеАвансов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗакрытиеВосьмого" 

	Дано Я открываю основную форму списка документа "ЗакрытиеВосьмого"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗакрытиеВосьмого"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗакрытиеВосьмого"

	Дано Я открываю основную форму документа "ЗакрытиеВосьмого"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗакрытиеВосьмого"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗакрытиеМесяца" 

	Дано Я открываю основную форму списка документа "ЗакрытиеМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗакрытиеМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗакрытиеМесяца"

	Дано Я открываю основную форму документа "ЗакрытиеМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗакрытиеМесяца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗакрытиеСчетов" 

	Дано Я открываю основную форму списка документа "ЗакрытиеСчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗакрытиеСчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗакрытиеСчетов"

	Дано Я открываю основную форму документа "ЗакрытиеСчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗакрытиеСчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеНаВысвобождение" 

	Дано Я открываю основную форму списка документа "ЗаявлениеНаВысвобождение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеНаВысвобождение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеНаВысвобождение"

	Дано Я открываю основную форму документа "ЗаявлениеНаВысвобождение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеНаВысвобождение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеНаВысвобождениеСписком" 

	Дано Я открываю основную форму списка документа "ЗаявлениеНаВысвобождениеСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеНаВысвобождениеСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеНаВысвобождениеСписком"

	Дано Я открываю основную форму документа "ЗаявлениеНаВысвобождениеСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеНаВысвобождениеСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеНаОсвобождениеПоПН" 

	Дано Я открываю основную форму списка документа "ЗаявлениеНаОсвобождениеПоПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеНаОсвобождениеПоПН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеНаОсвобождениеПоПН"

	Дано Я открываю основную форму документа "ЗаявлениеНаОсвобождениеПоПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеНаОсвобождениеПоПН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеНаценки" 

	Дано Я открываю основную форму списка документа "ИзменениеНаценки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеНаценки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеНаценки"

	Дано Я открываю основную форму документа "ИзменениеНаценки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеНаценки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеНаценкиСум" 

	Дано Я открываю основную форму списка документа "ИзменениеНаценкиСум"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеНаценкиСум"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеНаценкиСум"

	Дано Я открываю основную форму документа "ИзменениеНаценкиСум"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеНаценкиСум"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеОкладаСписком" 

	Дано Я открываю основную форму списка документа "ИзменениеОкладаСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеОкладаСписком"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеОкладаСписком"

	Дано Я открываю основную форму документа "ИзменениеОкладаСписком"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеОкладаСписком"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеПлановыхУдержаний" 

	Дано Я открываю основную форму списка документа "ИзменениеПлановыхУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПлановыхУдержаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеПлановыхУдержаний"

	Дано Я открываю основную форму документа "ИзменениеПлановыхУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПлановыхУдержаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменитьСпособОтраженияБУ" 

	Дано Я открываю основную форму списка документа "ИзменитьСпособОтраженияБУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменитьСпособОтраженияБУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменитьСпособОтраженияБУ"

	Дано Я открываю основную форму документа "ИзменитьСпособОтраженияБУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменитьСпособОтраженияБУ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзносОС" 

	Дано Я открываю основную форму списка документа "ИзносОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзносОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзносОС"

	Дано Я открываю основную форму документа "ИзносОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзносОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзносШинИАккумуляторов" 

	Дано Я открываю основную форму списка документа "ИзносШинИАккумуляторов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзносШинИАккумуляторов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзносШинИАккумуляторов"

	Дано Я открываю основную форму документа "ИзносШинИАккумуляторов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзносШинИАккумуляторов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Импорт" 

	Дано Я открываю основную форму списка документа "Импорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Импорт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Импорт"

	Дано Я открываю основную форму документа "Импорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Импорт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Инв1" 

	Дано Я открываю основную форму списка документа "Инв1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Инв1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Инв1"

	Дано Я открываю основную форму документа "Инв1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Инв1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Инв4" 

	Дано Я открываю основную форму списка документа "Инв4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Инв4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Инв4"

	Дано Я открываю основную форму документа "Инв4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Инв4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Инв5" 

	Дано Я открываю основную форму списка документа "Инв5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Инв5"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Инв5"

	Дано Я открываю основную форму документа "Инв5"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Инв5"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Инв6" 

	Дано Я открываю основную форму списка документа "Инв6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Инв6"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Инв6"

	Дано Я открываю основную форму документа "Инв6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Инв6"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Инв7" 

	Дано Я открываю основную форму списка документа "Инв7"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Инв7"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Инв7"

	Дано Я открываю основную форму документа "Инв7"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Инв7"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвПриказ" 

	Дано Я открываю основную форму списка документа "ИнвПриказ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвПриказ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвПриказ"

	Дано Я открываю основную форму документа "ИнвПриказ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвПриказ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровоеПеремещение" 

	Дано Я открываю основную форму списка документа "КадровоеПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КадровоеПеремещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровоеПеремещение"

	Дано Я открываю основную форму документа "КадровоеПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КадровоеПеремещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Калькуляция" 

	Дано Я открываю основную форму списка документа "Калькуляция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Калькуляция"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Калькуляция"

	Дано Я открываю основную форму документа "Калькуляция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Калькуляция"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КапитализацияЗатрат" 

	Дано Я открываю основную форму списка документа "КапитализацияЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КапитализацияЗатрат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КапитализацияЗатрат"

	Дано Я открываю основную форму документа "КапитализацияЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КапитализацияЗатрат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомплектацияНоменклатуры" 

	Дано Я открываю основную форму списка документа "КомплектацияНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КомплектацияНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомплектацияНоменклатуры"

	Дано Я открываю основную форму документа "КомплектацияНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КомплектацияНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаЗаписейРегистровНакопления" 

	Дано Я открываю основную форму списка документа "КорректировкаЗаписейРегистровНакопления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаЗаписейРегистровНакопления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаЗаписейРегистровНакопления"

	Дано Я открываю основную форму документа "КорректировкаЗаписейРегистровНакопления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаЗаписейРегистровНакопления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаРегистров" 

	Дано Я открываю основную форму списка документа "КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРегистров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаРегистров"

	Дано Я открываю основную форму документа "КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРегистров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛимитноЗаборнаяКарта" 

	Дано Я открываю основную форму списка документа "ЛимитноЗаборнаяКарта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛимитноЗаборнаяКарта"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛимитноЗаборнаяКарта"

	Дано Я открываю основную форму документа "ЛимитноЗаборнаяКарта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЛимитноЗаборнаяКарта"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Льготы" 

	Дано Я открываю основную форму списка документа "Льготы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Льготы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Льготы"

	Дано Я открываю основную форму документа "Льготы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Льготы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МатериальнаяПомощь" 

	Дано Я открываю основную форму списка документа "МатериальнаяПомощь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МатериальнаяПомощь"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МатериальнаяПомощь"

	Дано Я открываю основную форму документа "МатериальнаяПомощь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МатериальнаяПомощь"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НакоплениеОсвобожденийПоПН" 

	Дано Я открываю основную форму списка документа "НакоплениеОсвобожденийПоПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НакоплениеОсвобожденийПоПН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НакоплениеОсвобожденийПоПН"

	Дано Я открываю основную форму документа "НакоплениеОсвобожденийПоПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НакоплениеОсвобожденийПоПН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НалогНаВоду" 

	Дано Я открываю основную форму списка документа "НалогНаВоду"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НалогНаВоду"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НалогНаВоду"

	Дано Я открываю основную форму документа "НалогНаВоду"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НалогНаВоду"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НалогНаЗемлю" 

	Дано Я открываю основную форму списка документа "НалогНаЗемлю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НалогНаЗемлю"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НалогНаЗемлю"

	Дано Я открываю основную форму документа "НалогНаЗемлю"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НалогНаЗемлю"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НалогНаНедвижемоеИмущество_Новый" 

	Дано Я открываю основную форму списка документа "НалогНаНедвижемоеИмущество_Новый"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НалогНаНедвижемоеИмущество_Новый"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НалогНаНедвижемоеИмущество_Новый"

	Дано Я открываю основную форму документа "НалогНаНедвижемоеИмущество_Новый"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НалогНаНедвижемоеИмущество_Новый"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НарядПоЧасам" 

	Дано Я открываю основную форму списка документа "НарядПоЧасам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НарядПоЧасам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НарядПоЧасам"

	Дано Я открываю основную форму документа "НарядПоЧасам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НарядПоЧасам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачальныеОбороты" 

	Дано Я открываю основную форму списка документа "НачальныеОбороты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальныеОбороты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачальныеОбороты"

	Дано Я открываю основную форму документа "НачальныеОбороты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачальныеОбороты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеЗаработнойПлаты" 

	Дано Я открываю основную форму списка документа "НачислениеЗаработнойПлаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеЗаработнойПлаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеЗаработнойПлаты"

	Дано Я открываю основную форму документа "НачислениеЗаработнойПлаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеЗаработнойПлаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеИзносаОС" 

	Дано Я открываю основную форму списка документа "НачислениеИзносаОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеИзносаОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеИзносаОС"

	Дано Я открываю основную форму документа "НачислениеИзносаОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеИзносаОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеКомунальныхУслуг" 

	Дано Я открываю основную форму списка документа "НачислениеКомунальныхУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеКомунальныхУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеКомунальныхУслуг"

	Дано Я открываю основную форму документа "НачислениеКомунальныхУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеКомунальныхУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Начисления" 

	Дано Я открываю основную форму списка документа "Начисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Начисления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Начисления"

	Дано Я открываю основную форму документа "Начисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Начисления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислИзносНМА" 

	Дано Я открываю основную форму списка документа "НачислИзносНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислИзносНМА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислИзносНМА"

	Дано Я открываю основную форму документа "НачислИзносНМА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислИзносНМА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщепитЗакрытие852" 

	Дано Я открываю основную форму списка документа "ОбщепитЗакрытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитЗакрытие852"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщепитЗакрытие852"

	Дано Я открываю основную форму документа "ОбщепитЗакрытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитЗакрытие852"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщепитКалькуляция" 

	Дано Я открываю основную форму списка документа "ОбщепитКалькуляция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитКалькуляция"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщепитКалькуляция"

	Дано Я открываю основную форму документа "ОбщепитКалькуляция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитКалькуляция"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщепитЛимитноЗаборнаяКарта" 

	Дано Я открываю основную форму списка документа "ОбщепитЛимитноЗаборнаяКарта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитЛимитноЗаборнаяКарта"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщепитЛимитноЗаборнаяКарта"

	Дано Я открываю основную форму документа "ОбщепитЛимитноЗаборнаяКарта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитЛимитноЗаборнаяКарта"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщепитОткрытие852" 

	Дано Я открываю основную форму списка документа "ОбщепитОткрытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитОткрытие852"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщепитОткрытие852"

	Дано Я открываю основную форму документа "ОбщепитОткрытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитОткрытие852"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщепитРеализацияБлюдИТоваров" 

	Дано Я открываю основную форму списка документа "ОбщепитРеализацияБлюдИТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитРеализацияБлюдИТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщепитРеализацияБлюдИТоваров"

	Дано Я открываю основную форму документа "ОбщепитРеализацияБлюдИТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитРеализацияБлюдИТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщепитСпецификация" 

	Дано Я открываю основную форму списка документа "ОбщепитСпецификация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитСпецификация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщепитСпецификация"

	Дано Я открываю основную форму документа "ОбщепитСпецификация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитСпецификация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщепитСписаниеСпеций" 

	Дано Я открываю основную форму списка документа "ОбщепитСписаниеСпеций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитСписаниеСпеций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщепитСписаниеСпеций"

	Дано Я открываю основную форму документа "ОбщепитСписаниеСпеций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбщепитСписаниеСпеций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Операция" 

	Дано Я открываю основную форму списка документа "Операция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Операция"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Операция"

	Дано Я открываю основную форму документа "Операция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Операция"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияХозрасчетный" 

	Дано Я открываю основную форму списка документа "ОперацияХозрасчетный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияХозрасчетный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияХозрасчетный"

	Дано Я открываю основную форму документа "ОперацияХозрасчетный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияХозрасчетный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОплатаКомунальныхУслуг" 

	Дано Я открываю основную форму списка документа "ОплатаКомунальныхУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОплатаКомунальныхУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОплатаКомунальныхУслуг"

	Дано Я открываю основную форму документа "ОплатаКомунальныхУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОплатаКомунальныхУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Открытие821" 

	Дано Я открываю основную форму списка документа "Открытие821"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Открытие821"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Открытие821"

	Дано Я открываю основную форму документа "Открытие821"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Открытие821"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Открытие821сум" 

	Дано Я открываю основную форму списка документа "Открытие821сум"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Открытие821сум"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Открытие821сум"

	Дано Я открываю основную форму документа "Открытие821сум"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Открытие821сум"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Открытие852" 

	Дано Я открываю основную форму списка документа "Открытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Открытие852"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Открытие852"

	Дано Я открываю основную форму документа "Открытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Открытие852"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКассира" 

	Дано Я открываю основную форму списка документа "ОтчетКассира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКассира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКассира"

	Дано Я открываю основную форму документа "ОтчетКассира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКассира"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетОРозничныхПродажах" 

	Дано Я открываю основную форму списка документа "ОтчетОРозничныхПродажах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОРозничныхПродажах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетОРозничныхПродажах"

	Дано Я открываю основную форму документа "ОтчетОРозничныхПродажах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОРозничныхПродажах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаВРозницу" 

	Дано Я открываю основную форму списка документа "ПередачаВРозницу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаВРозницу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаВРозницу"

	Дано Я открываю основную форму документа "ПередачаВРозницу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаВРозницу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаВРозницуСум" 

	Дано Я открываю основную форму списка документа "ПередачаВРозницуСум"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаВРозницуСум"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаВРозницуСум"

	Дано Я открываю основную форму документа "ПередачаВРозницуСум"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаВРозницуСум"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаГотовойПродукцииНаСклад" 

	Дано Я открываю основную форму списка документа "ПередачаГотовойПродукцииНаСклад"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаГотовойПродукцииНаСклад"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаГотовойПродукцииНаСклад"

	Дано Я открываю основную форму документа "ПередачаГотовойПродукцииНаСклад"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаГотовойПродукцииНаСклад"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Перемещение" 

	Дано Я открываю основную форму списка документа "Перемещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Перемещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Перемещение"

	Дано Я открываю основную форму документа "Перемещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Перемещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеПоРознЦенам" 

	Дано Я открываю основную форму списка документа "ПеремещениеПоРознЦенам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеПоРознЦенам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеПоРознЦенам"

	Дано Я открываю основную форму документа "ПеремещениеПоРознЦенам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеПоРознЦенам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеПоРознЦенамСум" 

	Дано Я открываю основную форму списка документа "ПеремещениеПоРознЦенамСум"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеПоРознЦенамСум"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеПоРознЦенамСум"

	Дано Я открываю основную форму документа "ПеремещениеПоРознЦенамСум"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеПоРознЦенамСум"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеТоваров" 

	Дано Я открываю основную форму списка документа "ПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеТоваров"

	Дано Я открываю основную форму документа "ПеремещениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереносОстатков" 

	Дано Я открываю основную форму списка документа "ПереносОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносОстатков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереносОстатков"

	Дано Я открываю основную форму документа "ПереносОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносОстатков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереносСправочникоИОстатков" 

	Дано Я открываю основную форму списка документа "ПереносСправочникоИОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносСправочникоИОстатков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереносСправочникоИОстатков"

	Дано Я открываю основную форму документа "ПереносСправочникоИОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереносСправочникоИОстатков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереоценкаВалюты" 

	Дано Я открываю основную форму списка документа "ПереоценкаВалюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереоценкаВалюты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереоценкаВалюты"

	Дано Я открываю основную форму документа "ПереоценкаВалюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереоценкаВалюты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлатежкаВалютная" 

	Дано Я открываю основную форму списка документа "ПлатежкаВалютная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлатежкаВалютная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлатежкаВалютная"

	Дано Я открываю основную форму документа "ПлатежкаВалютная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлатежкаВалютная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлатежнаяВедомость" 

	Дано Я открываю основную форму списка документа "ПлатежнаяВедомость"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлатежнаяВедомость"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлатежнаяВедомость"

	Дано Я открываю основную форму документа "ПлатежнаяВедомость"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлатежнаяВедомость"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлатежноеПоручение" 

	Дано Я открываю основную форму списка документа "ПлатежноеПоручение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлатежноеПоручение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлатежноеПоручение"

	Дано Я открываю основную форму документа "ПлатежноеПоручение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлатежноеПоручение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеОС" 

	Дано Я открываю основную форму списка документа "ПоступлениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеОС"

	Дано Я открываю основную форму документа "ПоступлениеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемНаРаботу" 

	Дано Я открываю основную форму списка документа "ПриемНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемНаРаботу"

	Дано Я открываю основную форму документа "ПриемНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрихНалоговаяНакладная" 

	Дано Я открываю основную форму списка документа "ПрихНалоговаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрихНалоговаяНакладная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрихНалоговаяНакладная"

	Дано Я открываю основную форму документа "ПрихНалоговаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрихНалоговаяНакладная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриходБСО" 

	Дано Я открываю основную форму списка документа "ПриходБСО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходБСО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриходБСО"

	Дано Я открываю основную форму документа "ПриходБСО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходБСО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриходныйКассовый" 

	Дано Я открываю основную форму списка документа "ПриходныйКассовый"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйКассовый"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриходныйКассовый"

	Дано Я открываю основную форму документа "ПриходныйКассовый"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйКассовый"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПутевойЛист" 

	Дано Я открываю основную форму списка документа "ПутевойЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПутевойЛист"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПутевойЛист"

	Дано Я открываю основную форму документа "ПутевойЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПутевойЛист"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазовыеНачисления" 

	Дано Я открываю основную форму списка документа "РазовыеНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РазовыеНачисления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазовыеНачисления"

	Дано Я открываю основную форму документа "РазовыеНачисления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РазовыеНачисления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазовыеУдержания" 

	Дано Я открываю основную форму списка документа "РазовыеУдержания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РазовыеУдержания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазовыеУдержания"

	Дано Я открываю основную форму документа "РазовыеУдержания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РазовыеУдержания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_ВыбытиеУгодий" 

	Дано Я открываю основную форму списка документа "Растениеводство_ВыбытиеУгодий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_ВыбытиеУгодий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_ВыбытиеУгодий"

	Дано Я открываю основную форму документа "Растениеводство_ВыбытиеУгодий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_ВыбытиеУгодий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_ВыпускУрожая" 

	Дано Я открываю основную форму списка документа "Растениеводство_ВыпускУрожая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_ВыпускУрожая"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_ВыпускУрожая"

	Дано Я открываю основную форму документа "Растениеводство_ВыпускУрожая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_ВыпускУрожая"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_Доведение211" 

	Дано Я открываю основную форму списка документа "Растениеводство_Доведение211"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_Доведение211"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_Доведение211"

	Дано Я открываю основную форму документа "Растениеводство_Доведение211"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_Доведение211"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_Доведение216" 

	Дано Я открываю основную форму списка документа "Растениеводство_Доведение216"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_Доведение216"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_Доведение216"

	Дано Я открываю основную форму документа "Растениеводство_Доведение216"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_Доведение216"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_ДоляCтоимости" 

	Дано Я открываю основную форму списка документа "Растениеводство_ДоляCтоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_ДоляCтоимости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_ДоляCтоимости"

	Дано Я открываю основную форму документа "Растениеводство_ДоляCтоимости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_ДоляCтоимости"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_ДоляЗемельногоУчастка" 

	Дано Я открываю основную форму списка документа "Растениеводство_ДоляЗемельногоУчастка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_ДоляЗемельногоУчастка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_ДоляЗемельногоУчастка"

	Дано Я открываю основную форму документа "Растениеводство_ДоляЗемельногоУчастка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_ДоляЗемельногоУчастка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_Закрытие852" 

	Дано Я открываю основную форму списка документа "Растениеводство_Закрытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_Закрытие852"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_Закрытие852"

	Дано Я открываю основную форму документа "Растениеводство_Закрытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_Закрытие852"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_Калькуляция" 

	Дано Я открываю основную форму списка документа "Растениеводство_Калькуляция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_Калькуляция"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_Калькуляция"

	Дано Я открываю основную форму документа "Растениеводство_Калькуляция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_Калькуляция"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_ЛимитноЗаборнаяКарта" 

	Дано Я открываю основную форму списка документа "Растениеводство_ЛимитноЗаборнаяКарта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_ЛимитноЗаборнаяКарта"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_ЛимитноЗаборнаяКарта"

	Дано Я открываю основную форму документа "Растениеводство_ЛимитноЗаборнаяКарта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_ЛимитноЗаборнаяКарта"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_Открытие852" 

	Дано Я открываю основную форму списка документа "Растениеводство_Открытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_Открытие852"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_Открытие852"

	Дано Я открываю основную форму документа "Растениеводство_Открытие852"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_Открытие852"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_РаспределениеОО" 

	Дано Я открываю основную форму списка документа "Растениеводство_РаспределениеОО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_РаспределениеОО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_РаспределениеОО"

	Дано Я открываю основную форму документа "Растениеводство_РаспределениеОО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_РаспределениеОО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_СписаниеМатериалов" 

	Дано Я открываю основную форму списка документа "Растениеводство_СписаниеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_СписаниеМатериалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_СписаниеМатериалов"

	Дано Я открываю основную форму документа "Растениеводство_СписаниеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_СписаниеМатериалов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Растениеводство_УборкаУрожая" 

	Дано Я открываю основную форму списка документа "Растениеводство_УборкаУрожая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_УборкаУрожая"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Растениеводство_УборкаУрожая"

	Дано Я открываю основную форму документа "Растениеводство_УборкаУрожая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Растениеводство_УборкаУрожая"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасхНалоговаяНакладная" 

	Дано Я открываю основную форму списка документа "РасхНалоговаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасхНалоговаяНакладная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасхНалоговаяНакладная"

	Дано Я открываю основную форму документа "РасхНалоговаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасхНалоговаяНакладная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходныйКассовый" 

	Дано Я открываю основную форму списка документа "РасходныйКассовый"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйКассовый"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходныйКассовый"

	Дано Я открываю основную форму документа "РасходныйКассовый"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйКассовый"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетБольничных" 

	Дано Я открываю основную форму списка документа "РасчетБольничных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетБольничных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетБольничных"

	Дано Я открываю основную форму документа "РасчетБольничных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетБольничных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетБольничных2010" 

	Дано Я открываю основную форму списка документа "РасчетБольничных2010"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетБольничных2010"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетБольничных2010"

	Дано Я открываю основную форму документа "РасчетБольничных2010"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетБольничных2010"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетЗаработнойПлатыОтОбратного" 

	Дано Я открываю основную форму списка документа "РасчетЗаработнойПлатыОтОбратного"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетЗаработнойПлатыОтОбратного"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетЗаработнойПлатыОтОбратного"

	Дано Я открываю основную форму документа "РасчетЗаработнойПлатыОтОбратного"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетЗаработнойПлатыОтОбратного"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетМестныхСборов" 

	Дано Я открываю основную форму списка документа "РасчетМестныхСборов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетМестныхСборов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетМестныхСборов"

	Дано Я открываю основную форму документа "РасчетМестныхСборов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетМестныхСборов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетОплатыНерабочихПраздничныхДней" 

	Дано Я открываю основную форму списка документа "РасчетОплатыНерабочихПраздничныхДней"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетОплатыНерабочихПраздничныхДней"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетОплатыНерабочихПраздничныхДней"

	Дано Я открываю основную форму документа "РасчетОплатыНерабочихПраздничныхДней"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетОплатыНерабочихПраздничныхДней"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетОплатыНерабочихПраздничныхДнейРасш" 

	Дано Я открываю основную форму списка документа "РасчетОплатыНерабочихПраздничныхДнейРасш"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетОплатыНерабочихПраздничныхДнейРасш"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетОплатыНерабочихПраздничныхДнейРасш"

	Дано Я открываю основную форму документа "РасчетОплатыНерабочихПраздничныхДнейРасш"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетОплатыНерабочихПраздничныхДнейРасш"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетОтпускных" 

	Дано Я открываю основную форму списка документа "РасчетОтпускных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетОтпускных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетОтпускных"

	Дано Я открываю основную форму документа "РасчетОтпускных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетОтпускных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетОтпускных2010" 

	Дано Я открываю основную форму списка документа "РасчетОтпускных2010"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетОтпускных2010"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетОтпускных2010"

	Дано Я открываю основную форму документа "РасчетОтпускных2010"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетОтпускных2010"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетПоСредней" 

	Дано Я открываю основную форму списка документа "РасчетПоСредней"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетПоСредней"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетПоСредней"

	Дано Я открываю основную форму документа "РасчетПоСредней"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетПоСредней"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетСредПроц" 

	Дано Я открываю основную форму списка документа "РасчетСредПроц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетСредПроц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетСредПроц"

	Дано Я открываю основную форму документа "РасчетСредПроц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасчетСредПроц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегламентированныйОтчет" 

	Дано Я открываю основную форму списка документа "РегламентированныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегламентированныйОтчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегламентированныйОтчет"

	Дано Я открываю основную форму документа "РегламентированныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегламентированныйОтчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РучнаяОперацияПоПроектамИДонорамХоз" 

	Дано Я открываю основную форму списка документа "РучнаяОперацияПоПроектамИДонорамХоз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РучнаяОперацияПоПроектамИДонорамХоз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РучнаяОперацияПоПроектамИДонорамХоз"

	Дано Я открываю основную форму документа "РучнаяОперацияПоПроектамИДонорамХоз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РучнаяОперацияПоПроектамИДонорамХоз"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РыночныеСборы" 

	Дано Я открываю основную форму списка документа "РыночныеСборы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РыночныеСборы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РыночныеСборы"

	Дано Я открываю основную форму документа "РыночныеСборы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РыночныеСборы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СборЗаОбъектыТорговли" 

	Дано Я открываю основную форму списка документа "СборЗаОбъектыТорговли"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборЗаОбъектыТорговли"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СборЗаОбъектыТорговли"

	Дано Я открываю основную форму документа "СборЗаОбъектыТорговли"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборЗаОбъектыТорговли"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СборЗаРазмещениеРекламы" 

	Дано Я открываю основную форму списка документа "СборЗаРазмещениеРекламы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборЗаРазмещениеРекламы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СборЗаРазмещениеРекламы"

	Дано Я открываю основную форму документа "СборЗаРазмещениеРекламы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборЗаРазмещениеРекламы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СборЗаРекламныеУстройства" 

	Дано Я открываю основную форму списка документа "СборЗаРекламныеУстройства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборЗаРекламныеУстройства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СборЗаРекламныеУстройства"

	Дано Я открываю основную форму документа "СборЗаРекламныеУстройства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборЗаРекламныеУстройства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СборЗаСимволику" 

	Дано Я открываю основную форму списка документа "СборЗаСимволику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборЗаСимволику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СборЗаСимволику"

	Дано Я открываю основную форму документа "СборЗаСимволику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборЗаСимволику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СборЗаУличныеОбъектыТорговлиИИлиОбъектыПоОказаниюУслуг" 

	Дано Я открываю основную форму списка документа "СборЗаУличныеОбъектыТорговлиИИлиОбъектыПоОказаниюУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборЗаУличныеОбъектыТорговлиИИлиОбъектыПоОказаниюУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СборЗаУличныеОбъектыТорговлиИИлиОбъектыПоОказаниюУслуг"

	Дано Я открываю основную форму документа "СборЗаУличныеОбъектыТорговлиИИлиОбъектыПоОказаниюУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборЗаУличныеОбъектыТорговлиИИлиОбъектыПоОказаниюУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СборНаБлагоустройство" 

	Дано Я открываю основную форму списка документа "СборНаБлагоустройство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборНаБлагоустройство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СборНаБлагоустройство"

	Дано Я открываю основную форму документа "СборНаБлагоустройство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборНаБлагоустройство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СборСВладельцевТранспортныхСредств" 

	Дано Я открываю основную форму списка документа "СборСВладельцевТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборСВладельцевТранспортныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СборСВладельцевТранспортныхСредств"

	Дано Я открываю основную форму документа "СборСВладельцевТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборСВладельцевТранспортныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Спецификация" 

	Дано Я открываю основную форму списка документа "Спецификация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Спецификация"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Спецификация"

	Дано Я открываю основную форму документа "Спецификация"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Спецификация"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеБСО" 

	Дано Я открываю основную форму списка документа "СписаниеБСО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеБСО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеБСО"

	Дано Я открываю основную форму документа "СписаниеБСО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеБСО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеОС" 

	Дано Я открываю основную форму списка документа "СписаниеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеОС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеОС"

	Дано Я открываю основную форму документа "СписаниеОС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеОС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеРасходовБудущихПериодов" 

	Дано Я открываю основную форму списка документа "СписаниеРасходовБудущихПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеРасходовБудущихПериодов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеРасходовБудущихПериодов"

	Дано Я открываю основную форму документа "СписаниеРасходовБудущихПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеРасходовБудущихПериодов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеШин" 

	Дано Я открываю основную форму списка документа "СписаниеШин"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеШин"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеШин"

	Дано Я открываю основную форму документа "СписаниеШин"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеШин"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Сторно" 

	Дано Я открываю основную форму списка документа "Сторно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Сторно"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Сторно"

	Дано Я открываю основную форму документа "Сторно"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Сторно"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТабельУчетаРабочегоВремени" 

	Дано Я открываю основную форму списка документа "ТабельУчетаРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТабельУчетаРабочегоВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТабельУчетаРабочегоВремени"

	Дано Я открываю основную форму документа "ТабельУчетаРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТабельУчетаРабочегоВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТабельУчетаРабочегоВремени2010" 

	Дано Я открываю основную форму списка документа "ТабельУчетаРабочегоВремени2010"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТабельУчетаРабочегоВремени2010"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТабельУчетаРабочегоВремени2010"

	Дано Я открываю основную форму документа "ТабельУчетаРабочегоВремени2010"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТабельУчетаРабочегоВремени2010"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварныйОтчет" 

	Дано Я открываю основную форму списка документа "ТоварныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТоварныйОтчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварныйОтчет"

	Дано Я открываю основную форму документа "ТоварныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТоварныйОтчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Увольнение" 

	Дано Я открываю основную форму списка документа "Увольнение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Увольнение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Увольнение"

	Дано Я открываю основную форму документа "Увольнение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Увольнение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьДляСоцФонда" 

	Дано Я открываю основную форму списка документа "УдалитьДляСоцФонда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьДляСоцФонда"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьДляСоцФонда"

	Дано Я открываю основную форму документа "УдалитьДляСоцФонда"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьДляСоцФонда"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьДляСоцФонда2009" 

	Дано Я открываю основную форму списка документа "УдалитьДляСоцФонда2009"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьДляСоцФонда2009"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьДляСоцФонда2009"

	Дано Я открываю основную форму документа "УдалитьДляСоцФонда2009"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьДляСоцФонда2009"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьДляСоцФонда2012" 

	Дано Я открываю основную форму списка документа "УдалитьДляСоцФонда2012"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьДляСоцФонда2012"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьДляСоцФонда2012"

	Дано Я открываю основную форму документа "УдалитьДляСоцФонда2012"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьДляСоцФонда2012"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗаменаАвтошин" 

	Дано Я открываю основную форму списка документа "УдалитьЗаменаАвтошин"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗаменаАвтошин"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗаменаАвтошин"

	Дано Я открываю основную форму документа "УдалитьЗаменаАвтошин"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗаменаАвтошин"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаКуратораДляПотребителя" 

	Дано Я открываю основную форму списка документа "УстановкаКуратораДляПотребителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаКуратораДляПотребителя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаКуратораДляПотребителя"

	Дано Я открываю основную форму документа "УстановкаКуратораДляПотребителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаКуратораДляПотребителя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаТарифаНаКоммунальныеУслуги" 

	Дано Я открываю основную форму списка документа "УстановкаТарифаНаКоммунальныеУслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаТарифаНаКоммунальныеУслуги"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаТарифаНаКоммунальныеУслуги"

	Дано Я открываю основную форму документа "УстановкаТарифаНаКоммунальныеУслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаТарифаНаКоммунальныеУслуги"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаТекущихПоказанийСчетчиков" 

	Дано Я открываю основную форму списка документа "УстановкаТекущихПоказанийСчетчиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаТекущихПоказанийСчетчиков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаТекущихПоказанийСчетчиков"

	Дано Я открываю основную форму документа "УстановкаТекущихПоказанийСчетчиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаТекущихПоказанийСчетчиков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УстановкаЦенНоменклатуры" 

	Дано Я открываю основную форму списка документа "УстановкаЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаЦенНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УстановкаЦенНоменклатуры"

	Дано Я открываю основную форму документа "УстановкаЦенНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УстановкаЦенНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблонТиповогоДокумента" 

	Дано Я открываю основную форму списка документа "ШаблонТиповогоДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ШаблонТиповогоДокумента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблонТиповогоДокумента"

	Дано Я открываю основную форму документа "ШаблонТиповогоДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ШаблонТиповогоДокумента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Приказ" 

	Дано Я открываю основную форму списка документа "Приказ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Приказ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Приказ"

	Дано Я открываю основную форму документа "Приказ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Приказ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "CRM_ЗаказКлиента" 

	Дано Я открываю основную форму списка документа "CRM_ЗаказКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа CRM_ЗаказКлиента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "CRM_ЗаказКлиента"

	Дано Я открываю основную форму документа "CRM_ЗаказКлиента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа CRM_ЗаказКлиента"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "CRM_КоммерческоеПредложение" 

	Дано Я открываю основную форму списка документа "CRM_КоммерческоеПредложение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа CRM_КоммерческоеПредложение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "CRM_КоммерческоеПредложение"

	Дано Я открываю основную форму документа "CRM_КоммерческоеПредложение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа CRM_КоммерческоеПредложение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИТД" 

	Дано Я открываю основную форму списка документа "ИТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИТД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИТД"

	Дано Я открываю основную форму документа "ИТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИТД"
	И Я закрываю текущее окно


